Revit 2027 API
Connector.ConnectTo Method
Make connection between two connectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ConnectTo(
	Connector connector
)
Public Sub ConnectTo (
	connector As Connector
)
public:
void ConnectTo(
	Connector^ connector
)
member ConnectTo :
        connector : Connector -> unit
Parameters
connector Connector
Indicate the connector will be connected to.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when argument is null.
ArgumentException |  Argument is invalid.
InvalidOperationException |  Thrown when two connectors with different domain types. Thrown when these two connectors fail to connect each other. Thrown when connection already exists.
Remarks
Connection success may create a new Fitting between two connectors, if necessary.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace